rhgndf/py32-data/svd/PY32F410xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <groupName>COMP</groupName>
      <baseAddress>0x40016C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INNSEL</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BLANKSEL</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV_EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV</name>
              <bitRange>[27:20]</bitRange>
            </field>
            <field>
              <name>COMP_VCSEL</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>TIM_EXTI_OUT_SEL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP1_OUT</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT1</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2</name>
      <baseAddress>0x40016C10</baseAddress>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>CRC data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>CRC independent data</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RESET</name>
              <description>CRC software reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_STDBY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DBG_TIM1_STOP</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_TIM2_STOP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_TIM4_STOP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DBG_I2C1_SMBUS_TIMEOUT</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_I2C2_SMBUS_TIMEOUT</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DBG_TIM6_STOP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DBG_TIM7_STOP</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIM15_STOP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBG_TIM17_STOP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DBG_PWM1_STOP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DBG_PWM2_STOP</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_PWM3_STOP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_PWM4_STOP</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
