rhgndf/py32-data/svd/PY32F410xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xB0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ISR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TCIF1</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF1</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF1</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF2</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF2</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF2</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF2</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF3</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF3</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF3</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF3</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF4</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF4</name>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF4</name>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF4</name>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF5</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF5</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF5</name>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF5</name>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF6</name>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF6</name>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF6</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF6</name>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF7</name>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF7</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF7</name>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF7</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF8</name>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF8</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBIF8</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF8</name>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CTCIF1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBTCIF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHBTIF1</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CTEIF1</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTCIF2</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CBTCIF2</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHBTIF2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CTEIF2</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CTCIF3</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CBTCIF3</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CHBTIF3</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CTEIF3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CTCIF4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CBTCIF4</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBTIF4</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CTEIF4</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CTCIF5</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CBTCIF5</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHBTIF5</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CTEIF5</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CTCIF6</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CBTCIF6</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHBTIF6</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CTEIF6</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CTCIF7</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CBTCIF7</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CHBTIF7</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CTEIF7</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CTCIF8</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CBTCIF8</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CHBTIF8</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CTEIF8</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR1</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR1</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR1</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR2</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR2</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR2</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR2</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR3</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR3</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR3</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR3</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR4</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR4</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR4</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR4</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
