rhgndf/py32-data/svd/PY32F410xx.svd
        <register>
          <name>CCR5</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR5</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR5</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR5</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR5</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR6</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR6</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR6</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR6</name>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR7</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR7</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR7</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR7</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR7</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR8</name>
          <addressOffset>0x94</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MRELOAD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR8</name>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR8</name>
          <addressOffset>0x9C</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR8</name>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNBTR8</name>
          <addressOffset>0xA4</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
