rhgndf/py32-data/svd/PY32F410xx.svd
        <register>
          <name>AFRH</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>GPIOD8 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>GPIOD9 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>GPIOD10 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>GPIOD11 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>GPIOD 0 output pin reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOD 1 output pin reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOD 2 output pin reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOD 3 output pin reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOD 4 output pin reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOD 5 output pin reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOD 6 output pin reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOD 7 output pin reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOD 8 output pin reset</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOD 9 output pin reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOD 10 output pin reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOD 11 output pin reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>Peripheral enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SMBUS</name>
              <description>SMBus mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WUPEN</name>
              <description>Wakeup from Stop mode enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SMBTYPE</name>
              <description>SMBus type</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ENARP</name>
              <description>ARP enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ENPEC</name>
              <description>PEC enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ENGC</name>
              <description>General call enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NOSTRETCH</name>
              <description>Clock stretching disable (Slave mode)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>Start generation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop generation</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>Acknowledge enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>POS</name>
              <description>Acknowledge(for data reception)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PEC</name>
              <description>Packet error checking</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ALERT</name>
              <description>SMBus alert</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software reset</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WKUP_DIV</name>
              <description>PCLK division</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>WKUP_CNT</name>
              <description>Timeout count number</description>
              <bitRange>[19:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Peripheral clock frequency</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>ITERREN</name>
              <description>Error interrupt enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ITEVTEN</name>
              <description>Event interrupt enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ITBUFEN</name>
              <description>Buffer interrupt enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA requests enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LAST</name>
              <description>DMA last transfer</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADD</name>
              <description>Interface address</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADDMODE</name>
              <description>Addressing mode (slave mode)</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR2</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>ENDUAL</name>
              <description>Dual addressing mode enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADD2</name>
              <description>Interface address</description>
              <bitRange>[7:1]</bitRange>
            </field>
            <field>
              <name>OA2MSK</name>
              <description>Own Address 2 masks</description>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>8-bit data register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SB</name>
              <description>Start bit (Master mode)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address sent (master mode)/matched (slave mode)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTF</name>
              <description>Byte transfer finished</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADD10</name>
              <description>10-bit header sent (Master mode)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>Stop detection (slave mode)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>Data register not empty (receivers)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Data register empty (transmitters)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BERR</name>
              <description>Bus error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARLO</name>
              <description>Arbitration lost (master mode)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AF</name>
              <description>Acknowledge failure</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>Overrun/Underrun</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PECERR</name>
              <description>PEC Error in reception</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout or Tlow error</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SMBALERT</name>
              <description>SMBus alert</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>MSL</name>
              <description>Master/slave</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Bus busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRA</name>
              <description>Transmitter/receiver</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GENCALL</name>
              <description>General call address (Slave mode)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SMBDEFAULT</name>
              <description>SMBus device default address (Slave mode)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SMBHOST</name>
              <description>SMBus host header (Slave mode)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DUALF</name>
              <description>Dual flag (Slave mode)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PEC</name>
              <description>Packet error checking register</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CCR</name>
              <description>Clock control register in Fm/Sm mode (Master mode)</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>FP</name>
              <description>I2C master mode selection</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <description>Fm mode duty cycle</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FS</name>
              <description>I2C master mode selection</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>TRISE</name>
              <description>Maximum rise time in Fm+/Fm/Sm mode (Master mode)</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TDATAHOLD</name>
              <description>Data hold time</description>
              <bitRange>[11:7]</bitRange>
            </field>
            <field>
              <name>TDATAHOLD_SEL</name>
              <description>Data hold time select</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUTR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>TIMEOUTA</name>
              <description>Bus Timeout A</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>TIDLE</name>
              <description>Idle clock timeout detection</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TIMEOUTEN</name>
              <description>Clock timeout enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIMEOUTB</name>
              <description>Bus timeout B</description>
              <bitRange>[27:16]</bitRange>
            </field>
            <field>
              <name>TEXTEN</name>
              <description>Extended clock timeout enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
