rhgndf/py32-data/svd/PY32F410xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>IWDG KEY</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>IWDG preload</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RL</name>
              <description>IWDG reload</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LPTIM</name>
      <baseAddress>0x40007C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ISR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CMPM</name>
              <description>Compare match</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARRM</name>
              <description>Autoreload match</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTTRIG</name>
              <description>External trigger edge event</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPOK</name>
              <description>Compare register update OK</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARROK</name>
              <description>Autoreload register update OK</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UP</name>
              <description>Counter direction change down to up</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DOWN</name>
              <description>Counter direction change up to down</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CMPMCF</name>
              <description>Compare match clear flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ARRMCF</name>
              <description>Autoreload match clear flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EXTTRIGCF</name>
              <description>External trigger valid edge clear flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPOKCF</name>
              <description>Compare register update OK clear flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ARROKCF</name>
              <description>Autoreload register update OK clear flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UPCF</name>
              <description>Direction change to UP clear flag</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DOWNCF</name>
              <description>Direction change to down clear flag</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CMPMIE</name>
              <description>Compare match Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ARRMIE</name>
              <description>Autoreload match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EXTTRIGIE</name>
              <description>External trigger valid edge Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPOKIE</name>
              <description>Compare register update OK Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ARROKIE</name>
              <description>Autoreload register update OK Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UPIE</name>
              <description>Direction change to UP Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DOWNIE</name>
              <description>Direction change to down Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>CKSEL</name>
              <description>Clock selector</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CKPOL</name>
              <description>Clock Polarity</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>CKFLT</name>
              <description>Configurable digital filter for external clock</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>TRGFLT</name>
              <description>Configurable digital filter for trigger</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PRESC</name>
              <description>Clock prescaler</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>TRIGSEL</name>
              <description>Trigger selector</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>TRIGEN</name>
              <description>Trigger enable and polarity</description>
              <bitRange>[18:17]</bitRange>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timeout enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>WAVE</name>
              <description>Waveform shape</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>WAVPOL</name>
              <description>Waveform shape polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>PRELOAD</name>
              <description>Registers update mode</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ENC</name>
              <description>Encoder mode enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>LPTIM enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SNGSTRT</name>
              <description>LPTIM start in Single mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNTSTRT</name>
              <description>Timer start in Continuous mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CMP</name>
              <description>Compare value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <description>Auto reload value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter value</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>IN1_L</name>
              <description>LPTimer input 1 remap extension</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IN2_L</name>
              <description>LPTimer input 1 remap extension</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IN1_H</name>
              <description>LPTimer input 3 remap extension</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IN2_H</name>
              <description>LPTimer input 2 remap extension</description>
              <bitRange>[5:4]</bitRange>
            </field>
          </fields>
        </register>
