rhgndf/py32-data/svd/PY32F410xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PWM1">
      <name>PWM2</name>
      <baseAddress>0x40004000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PWM1">
      <name>PWM3</name>
      <baseAddress>0x40014000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWM4</name>
      <groupName>PWM</groupName>
      <baseAddress>0x40017800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>UIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OC1DE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC2DE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC3DE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC4DE</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>UIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>UG</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>OC1M</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC2M</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>OC3M</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>OC4M</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OC2PE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OC3PE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC4PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CER</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>C1E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C1P</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>C2E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>C2P</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>C3E</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>C3P</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>C4E</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>C4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CCR2</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CCR3</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CCR4</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>DBA</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>DMAB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
