rhgndf/py32-data/svd/PY32F410xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LPMS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MR_VSEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPR</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FLS_WUPT</name>
              <bitRange>[18:17]</bitRange>
            </field>
            <field>
              <name>STDBY_MRRDY_WAIT</name>
              <bitRange>[20:19]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PVDE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLS</name>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_CTRL</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EWUP1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EWUP2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EWUP3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EWUP4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EWUP5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RRS</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>WP1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WP2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WP3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WP4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WP5</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>WUF1</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF2</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF3</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF4</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF5</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_RDY</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CWUF1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CWUF2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CWUF3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CWUF4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CWUF5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSBF</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>desc RCC</description>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>clock control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>HSION</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIKERON</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HSITRIM</name>
              <bitRange>[14:4]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSSON</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLON</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIFS</name>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>clock configuration register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>HPRE</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PPRE1</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PPRE2</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>MCO</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIR</name>
          <description>clock interrupt register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSIRDYIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSERDYIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LSIRDYC</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSERDYC</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HSIRDYC</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HSERDYC</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLRDYC</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CSSC</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMA1RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IOPARST</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IOPBRST</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IOPCRST</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IOPDRST</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1RSTR1</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>TIM2RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM4RST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM6RST</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7RST</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>WWDGRST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PWM1RST</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PWM2RST</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>UART1RST</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>UART2RST</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1RST</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2RST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1RSTR2</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>LPTIM1RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LPUART1RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2RSTR</name>
          <description>APB2 peripheral reset register</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC1RST</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIM1RST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1RST</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1RST</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PWM3RST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM4RST</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM15RST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TIM16RST</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TIM17RST</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>COMPRST</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPAMPRST</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>DMA1EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SRAMEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FMCEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IOPAEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IOPBEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IOPCEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IOPDEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1ENR1</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>TIM2EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM3EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM4EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM6EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIM7EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PWM1EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PWM2EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>UART1EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>UART2EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1ENR2</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LPTIM1EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LPUART1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2ENR</name>
          <description>APB2 peripheral clock enable register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC1EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PWM3EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PWM4EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM15EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>COMPEN</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPAMPEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>USART1SEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LPUART1SEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>ADC1SEL</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OPAMP2SEL</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>Backup domain control register</description>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>LSEON</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSEDRV</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>RTCSEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
