rhgndf/py32-data/svd/PY32F410xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>memory mapping mode</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C1_FMP</name>
              <description>I2C1 Fast-mode Plus driving capability activation</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <description>I2C2 Fast-mode Plus driving capability activation</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C1_FLTEN</name>
              <description>I2C1 Fast-mode Plus driving capability activation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C2_FLTEN</name>
              <description>I2C2 Fast-mode Plus driving capability activation</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CLL</name>
              <description>core lockup enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDL</name>
              <description>pvd lock enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP1</name>
              <description>DMA1 ch1 mapping</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP2</name>
              <description>DMA1 ch2 mapping</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP3</name>
              <description>DMA1 ch3 mapping</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP4</name>
              <description>DMA1 ch4 mapping</description>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP5</name>
              <description>DMA1 ch5 mapping</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP6</name>
              <description>DMA1 ch6 mapping</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP7</name>
              <description>DMA1 ch7 mapping</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>DMA1_MAP8</name>
              <description>DMA1 ch8 mapping</description>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI2</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI 0~3 configuration</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI 4~7 configuration</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI 8~11 configuration</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>EXTI12</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI 12~15 configuration</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ENS</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>GPIOA noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ENS</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>GPIOB noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ENS</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PC_ENS</name>
              <description>GPIOC noise filter enable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ENS</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PD_ENS</name>
              <description>GPIOD noise filter enable</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_ANA2ENR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>PA0_ENA2</name>
              <description>PA0 analog2 enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PA1_ENA2</name>
              <description>PA1 analog2 enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PA2_ENA2</name>
              <description>PA2 analog2 enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PA3_ENA2</name>
              <description>PA3 analog2 enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PA4_ENA2</name>
              <description>PA4 analog2 enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PA5_ENA2</name>
              <description>PA5 analog2 enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PA9_ENA2</name>
              <description>PA7 analog2 enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PB1_ENA2</name>
              <description>PB1 analog2 enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
